Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes Constructor
Overload List
Name | Description
PlacingQuarterAttributes()
 Creates a new placing quarter attributes instance. The default parameters are: TopLeft = true, TopRight = true, BottomLeft = true, BottomRight = true.
PlacingQuarterAttributes(Boolean, Boolean, Boolean, Boolean)
 Creates a new placing quarter attributes instance with the given parameters.
Top
See Also
Reference
PlacingQuarterAttributes Class
Tekla.Structures.Drawing Namespace